---
kind: type
id: T:Autodesk.Revit.DB.ElementOnPhaseStatus
source: html/bfc481cc-11c8-de0b-1d71-7b2ffa711780.htm
---
# Autodesk.Revit.DB.ElementOnPhaseStatus

The statuses that an element can have with respect to a given phase.

## Syntax (C#)
```csharp
public enum ElementOnPhaseStatus
```